package org.practice_01.task_02;

public class MaxNumber {

    public static void main(String[] args) {
        System.out.println(findMax(5, 3));
    }

    static int findMax(int a, int b) {
        return Math.max(a, b);
    }

    /* Создайте метод findMax(int a, int b), который возвращает большее из двух чисел.
    Вызовите метод в main и выведите результат. */

}
